article/jdbc-source-codes.org
#+TITLE: JDBC 连接数据库
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2021-07-23 Fri 11:43:18>
#+HTML_LINK_UP: ../readme.html
#+HTML_LINK_HOME: ../index.html
#+SETUPFILE: ~/.emacs.d/site-lisp/org-html-themes/setup/theme-readtheorg-local.setup
#+TAGS: jdbc source


* JDBC 使用方法
** JDBC 连接数据库流程
   Java 中定义了 JDBC 的连接操作数据库的基本流程
   1. JDK 的实现包在 ~java.sql.*~ 下
   2. 实现包括如下四个步骤
   3. 注意 ~Class.forName(...)~ 是兼容性的写法
      - 低版本的 JDK 中没有加载数据库驱动的代码，需要显示加载驱动
      - 高版本的 JDK 不需要手动调用 ~Class.forName(...)~ 方法，在 ~DriverManager~
        的源码中可以看到一个静态块，通过 SPI 方式自动加载驱动
   #+BEGIN_SRC java
     private static String url = "jdbc:mysql://localhost:3306/database?useSSL=false";
     private static String username = "user01";
     private static String password = "pass01";

     public static void testMySQL() throws Exception {
       // 加载驱动
       Class.forName("com.mysql.jdbc.Driver");

       // 创建连接
       Connection conn = DriverManager.getConnection(url, username, password);

       // 发送 SQL 语句
       Statement stmt = conn.createStatement();
       ResultSet rs = stmt.executeQuery("SELECT 'Hello'");
       while (rs.next()) {
         // rs.getObject(1);
         String message = rs.getString(1);
         System.out.println(message);
       }

       // 关闭连接
       conn.close();
     }
   #+END_SRC

