article/jdbc-source-codes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-24 Sat 00:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>JDBC 连接数据库</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">JDBC 连接数据库</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge40788f">1. JDBC 使用方法</a>
<ul>
<li><a href="#org7d1dc45">1.1. JDBC 连接数据库流程</a></li>
<li><a href="#org8b22049">1.2. SPI 连接数据库流程</a></li>
</ul>
</li>
<li><a href="#orgd93aa4e">2. Spring 中的 <code>JdbcTemplate</code></a>
<ul>
<li><a href="#orgc59eab2">2.1. 数据库配置类</a></li>
<li><a href="#org0da55a1">2.2. 添加实体及 Mapper</a></li>
<li><a href="#orgdce52d8">2.3. 服务类 Service</a></li>
<li><a href="#org0bab6a5">2.4. 主函数</a></li>
</ul>
</li>
<li><a href="#org77b33d6">3. 代码实现</a>
<ul>
<li><a href="#org2c91a3d">3.1. <code>JdbcTemplate</code> 类</a></li>
<li><a href="#org5678806">3.2. 获取数据库连接</a></li>
<li><a href="#orgfeb88d7">3.3. 执行 SQL: <code>execute(...)</code> 方法</a></li>
<li><a href="#orga64b5bc">3.4. 数据库更新: <code>update(...)</code> 方法</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orge40788f" class="outline-2">
<h2 id="orge40788f"><span class="section-number-2">1</span> JDBC 使用方法</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7d1dc45" class="outline-3">
<h3 id="org7d1dc45"><span class="section-number-3">1.1</span> JDBC 连接数据库流程</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Java 中定义了 JDBC 的连接操作数据库的基本流程
</p>
<ol class="org-ol">
<li>JDK 的实现包在 <code>java.sql.*</code> 下</li>
<li>实现包括如下四个步骤</li>
<li>注意 <code>Class.forName(...)</code> 是兼容性的写法
<ul class="org-ul">
<li>低版本的 JDK 中没有加载数据库驱动的代码，需要显示加载驱动</li>
<li>高版本的 JDK 不需要手动调用 <code>Class.forName(...)</code> 方法，在 <code>DriverManager</code>
的源码中可以看到一个静态块，通过 SPI 方式自动加载驱动</li>
</ul></li>
</ol>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">url</span> = <span style="color: #2d9574;">"jdbc:mysql://localhost:3306/database?useSSL=false"</span>;
<span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">username</span> = <span style="color: #2d9574;">"user01"</span>;
<span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">password</span> = <span style="color: #2d9574;">"pass01"</span>;

<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">testMySQL</span><span style="color: #8d5649;">()</span> <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">Exception</span> <span style="color: #8d5649;">{</span>
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#21152;&#36733;&#39537;&#21160;</span>
  Class.forName<span style="color: #d8241f;">(</span><span style="color: #2d9574;">"com.mysql.jdbc.Driver"</span><span style="color: #d8241f;">)</span>;

  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#21019;&#24314;&#36830;&#25509;</span>
  <span style="color: #ce537a; font-weight: bold;">Connection</span> <span style="color: #7590db;">conn</span> = DriverManager.getConnection<span style="color: #d8241f;">(</span>url, username, password<span style="color: #d8241f;">)</span>;

  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#21457;&#36865; SQL &#35821;&#21477;</span>
  <span style="color: #ce537a; font-weight: bold;">Statement</span> <span style="color: #7590db;">stmt</span> = conn.createStatement<span style="color: #d8241f;">()</span>;
  <span style="color: #ce537a; font-weight: bold;">ResultSet</span> <span style="color: #7590db;">rs</span> = stmt.executeQuery<span style="color: #d8241f;">(</span><span style="color: #2d9574;">"SELECT 'Hello'"</span><span style="color: #d8241f;">)</span>;
  <span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #d8241f;">(</span>rs.next<span style="color: #9564bf;">()</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">rs.getObject(1);</span>
    <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">message</span> = rs.getString<span style="color: #9564bf;">(</span>1<span style="color: #9564bf;">)</span>;
    System.out.println<span style="color: #9564bf;">(</span>message<span style="color: #9564bf;">)</span>;
  <span style="color: #d8241f;">}</span>

  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20851;&#38381;&#36830;&#25509;</span>
  conn.close<span style="color: #d8241f;">()</span>;
<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>
