article/jdbc-source-codes.org
** SPI 连接数据库流程
   SPI (Service Provider Interface) 实际上是基于接口的编程, 策略模式和配置文件组
   合实现的动态加载机制

   1. 首先需要在运行路径中包含待加载的驱动 ~mysql-connector-java-5.1.47.jar~, 三
      方驱动在 =META-INF/services/java.sql.Driver= 中添加驱动配置信息
   2. ~DriverManager~ 的静态代码块中通过调用 ~loadInitialDrivers();~ 来读取使
      用驱动信息
      #+BEGIN_SRC java
        /**
         ,* Load the initial JDBC drivers by checking the System property
         ,* jdbc.properties and then use the {@code ServiceLoader} mechanism
         ,*/
        static {
            loadInitialDrivers();
            println("JDBC DriverManager initialized");
        }
      #+END_SRC
   3. 在 ~loadInitialDrivers();~ 方法中， ~ServiceLoader.load(Driver.class)~
      通过扫描 =META-INF/services= 目录下的配置文件找到实现类的全限定名，把类
      加载到 JVM
      #+BEGIN_SRC java
        AccessController.doPrivileged(new PrivilegedAction<Void>() {
            public Void run() {
              // 这里加载通过 ServiceLoader 调用 AppClassLoader 加载 JDBC 驱动
              ServiceLoader<Driver> loadedDrivers = ServiceLoader.load(Driver.class);
              Iterator<Driver> driversIterator = loadedDrivers.iterator();

              /* Load these drivers, so that they can be instantiated.
               ,* It may be the case that the driver class may not be there
               ,* i.e. there may be a packaged driver with the service class
               ,* as implementation of java.sql.Driver but the actual class
               ,* may be missing. In that case a java.util.ServiceConfigurationError
               ,* will be thrown at runtime by the VM trying to locate
               ,* and load the service.
               ,*
               ,* Adding a try catch block to catch those runtime errors
               ,* if driver not available in classpath but it's
               ,* packaged as service and that service is there in classpath.
               ,*/
              try{
                while(driversIterator.hasNext()) {
                  driversIterator.next();
                }
              } catch(Throwable t) {
                // Do nothing
              }
              return null;
            }
          });
      #+END_SRC
   4. 使用 ~DriverManager~ 中定义了 ~registeredDrivers~ 来存储项目中引用的确定类
      信息
      #+BEGIN_SRC java
        // List of registered JDBC drivers
        private final static CopyOnWriteArrayList<DriverInfo> registeredDrivers = new CopyOnWriteArrayList<>();
      #+END_SRC
   5. 调用 ~getConnection~ 方法时通过变量所有注册的驱动来获取连接信息
      #+BEGIN_SRC java
        //  Worker method called by the public getConnection() methods.
        private static Connection getConnection(
                                                String url, java.util.Properties info, Class<?> caller) throws SQLException {
          /*
           ,* When callerCl is null, we should check the application's
           ,* (which is invoking this class indirectly)
           ,* classloader, so that the JDBC driver class outside rt.jar
           ,* can be loaded from here.
           ,*/
          ClassLoader callerCL = caller != null ? caller.getClassLoader() : null;
          synchronized(DriverManager.class) {
            // synchronize loading of the correct classloader.
            if (callerCL == null) {
              callerCL = Thread.currentThread().getContextClassLoader();
            }
          }

          if(url == null) {
            throw new SQLException("The url cannot be null", "08001");
          }

          println("DriverManager.getConnection(\"" + url + "\")");

          // Walk through the loaded registeredDrivers attempting to make a connection.
          // Remember the first exception that gets raised so we can reraise it.
          SQLException reason = null;

          for(DriverInfo aDriver : registeredDrivers) {
            // If the caller does not have permission to load the driver then
            // skip it.
            if(isDriverAllowed(aDriver.driver, callerCL)) {
              try {
                println("    trying " + aDriver.driver.getClass().getName());
                Connection con = aDriver.driver.connect(url, info);
                if (con != null) {
                  // Success!
                  println("getConnection returning " + aDriver.driver.getClass().getName());
                  return (con);
                }
              } catch (SQLException ex) {
                if (reason == null) {
                  reason = ex;
                }
              }

            } else {
              println("    skipping: " + aDriver.getClass().getName());
            }

          }

          // if we got here nobody could connect.
          if (reason != null)    {
            println("getConnection failed: " + reason);
            throw reason;
          }

          println("getConnection: no suitable driver found for "+ url);
          throw new SQLException("No suitable driver found for "+ url, "08001");
        }
      #+END_SRC

