article/jdbc-source-codes.html

<div id="outline-container-org8b22049" class="outline-3">
<h3 id="org8b22049"><span class="section-number-3">1.2</span> SPI 连接数据库流程</h3>
<div class="outline-text-3" id="text-1-2">
<p>
SPI (Service Provider Interface) 实际上是基于接口的编程, 策略模式和配置文件组
合实现的动态加载机制
</p>

<ol class="org-ol">
<li>首先需要在运行路径中包含待加载的驱动 <code>mysql-connector-java-5.1.47.jar</code>, 三
方驱动在 <code>META-INF/services/java.sql.Driver</code> 中添加驱动配置信息</li>
<li><p>
<code>DriverManager</code> 的静态代码块中通过调用 <code>loadInitialDrivers();</code> 来读取使
用驱动信息
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #9f8766;">/**</span>
<span style="color: #9f8766;"> * Load the initial JDBC drivers by checking the System property</span>
<span style="color: #9f8766;"> * jdbc.properties and then use the </span><span style="color: #a45bad;">{@code ServiceLoader}</span><span style="color: #9f8766;"> mechanism</span>
<span style="color: #9f8766;"> */</span>
<span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #8d5649;">{</span>
    loadInitialDrivers<span style="color: #d8241f;">()</span>;
    println<span style="color: #d8241f;">(</span><span style="color: #2d9574;">"JDBC DriverManager initialized"</span><span style="color: #d8241f;">)</span>;
<span style="color: #8d5649;">}</span>
</pre>
</div></li>
<li><p>
在 <code>loadInitialDrivers();</code> 方法中， <code>ServiceLoader.load(Driver.class)</code>
通过扫描 <code>META-INF/services</code> 目录下的配置文件找到实现类的全限定名，把类
加载到 JVM
</p>
<div class="org-src-container">
<pre class="src src-java">AccessController.doPrivileged<span style="color: #8d5649;">(</span><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">PrivilegedAction</span><span style="color: #d8241f;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Void</span><span style="color: #d8241f;">&gt;()</span> <span style="color: #d8241f;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">Void</span> <span style="color: #bc6ec5; font-weight: bold;">run</span><span style="color: #9564bf;">()</span> <span style="color: #9564bf;">{</span>
      <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#36825;&#37324;&#21152;&#36733;&#36890;&#36807; ServiceLoader &#35843;&#29992; AppClassLoader &#21152;&#36733; JDBC &#39537;&#21160;</span>
      <span style="color: #ce537a; font-weight: bold;">ServiceLoader</span><span style="color: #24a222;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Driver</span><span style="color: #24a222;">&gt;</span> <span style="color: #7590db;">loadedDrivers</span> = ServiceLoader.load<span style="color: #24a222;">(</span>Driver.<span style="color: #4f97d7; font-weight: bold;">class</span><span style="color: #24a222;">)</span>;
      <span style="color: #ce537a; font-weight: bold;">Iterator</span><span style="color: #24a222;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Driver</span><span style="color: #24a222;">&gt;</span> <span style="color: #7590db;">driversIterator</span> = loadedDrivers.iterator<span style="color: #24a222;">()</span>;

      <span style="color: #93a1a1; font-style: italic;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">Load these drivers, so that they can be instantiated.</span>
<span style="color: #2aa1ae; background-color: #292e34;">       * It may be the case that the driver class may not be there</span>
<span style="color: #2aa1ae; background-color: #292e34;">       * i.e. there may be a packaged driver with the service class</span>
<span style="color: #2aa1ae; background-color: #292e34;">       * as implementation of java.sql.Driver but the actual class</span>
<span style="color: #2aa1ae; background-color: #292e34;">       * may be missing. In that case a java.util.ServiceConfigurationError</span>
<span style="color: #2aa1ae; background-color: #292e34;">       * will be thrown at runtime by the VM trying to locate</span>
<span style="color: #2aa1ae; background-color: #292e34;">       * and load the service.</span>
<span style="color: #2aa1ae; background-color: #292e34;">       *</span>
<span style="color: #2aa1ae; background-color: #292e34;">       * Adding a try catch block to catch those runtime errors</span>
<span style="color: #2aa1ae; background-color: #292e34;">       * if driver not available in classpath but it's</span>
<span style="color: #2aa1ae; background-color: #292e34;">       * packaged as service and that service is there in classpath.</span>
<span style="color: #93a1a1; font-style: italic;">       */</span>
      <span style="color: #4f97d7; font-weight: bold;">try</span><span style="color: #24a222;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">while</span><span style="color: #ff7f00;">(</span>driversIterator.hasNext<span style="color: #1776b6;">()</span><span style="color: #ff7f00;">)</span> <span style="color: #ff7f00;">{</span>
          driversIterator.next<span style="color: #1776b6;">()</span>;
        <span style="color: #ff7f00;">}</span>
      <span style="color: #24a222;">}</span> <span style="color: #4f97d7; font-weight: bold;">catch</span><span style="color: #24a222;">(</span><span style="color: #ce537a; font-weight: bold;">Throwable</span> <span style="color: #7590db;">t</span><span style="color: #24a222;">)</span> <span style="color: #24a222;">{</span>
        <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Do nothing</span>
      <span style="color: #24a222;">}</span>
      <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">null</span>;
    <span style="color: #9564bf;">}</span>
  <span style="color: #d8241f;">}</span><span style="color: #8d5649;">)</span>;
</pre>
</div></li>
<li><p>
使用 <code>DriverManager</code> 中定义了 <code>registeredDrivers</code> 来存储项目中引用的确定类
信息
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">List of registered JDBC drivers</span>
<span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">CopyOnWriteArrayList</span><span style="color: #8d5649;">&lt;</span><span style="color: #ce537a; font-weight: bold;">DriverInfo</span><span style="color: #8d5649;">&gt;</span> <span style="color: #7590db;">registeredDrivers</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">CopyOnWriteArrayList</span><span style="color: #8d5649;">&lt;&gt;()</span>;
</pre>
</div></li>
<li><p>
调用 <code>getConnection</code> 方法时通过变量所有注册的驱动来获取连接信息
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #93a1a1; font-style: italic;">//  </span><span style="color: #2aa1ae; background-color: #292e34;">Worker method called by the public getConnection() methods.</span>
<span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">Connection</span> <span style="color: #bc6ec5; font-weight: bold;">getConnection</span><span style="color: #8d5649;">(</span>
                                        <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">url</span>, <span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">util</span>.<span style="color: #ce537a; font-weight: bold;">Properties</span> <span style="color: #7590db;">info</span>, <span style="color: #ce537a; font-weight: bold;">Class</span><span style="color: #d8241f;">&lt;</span>?<span style="color: #d8241f;">&gt;</span> <span style="color: #7590db;">caller</span><span style="color: #8d5649;">)</span> <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">SQLException</span> <span style="color: #8d5649;">{</span>
  <span style="color: #93a1a1; font-style: italic;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;">   * When callerCl is null, we should check the application's</span>
<span style="color: #2aa1ae; background-color: #292e34;">   * (which is invoking this class indirectly)</span>
<span style="color: #2aa1ae; background-color: #292e34;">   * classloader, so that the JDBC driver class outside rt.jar</span>
<span style="color: #2aa1ae; background-color: #292e34;">   * can be loaded from here.</span>
<span style="color: #93a1a1; font-style: italic;">   */</span>
  <span style="color: #ce537a; font-weight: bold;">ClassLoader</span> <span style="color: #7590db;">callerCL</span> = caller != <span style="color: #a45bad;">null</span> ? caller.getClassLoader<span style="color: #d8241f;">()</span> : <span style="color: #a45bad;">null</span>;
  <span style="color: #4f97d7; font-weight: bold;">synchronized</span><span style="color: #d8241f;">(</span>DriverManager.<span style="color: #4f97d7; font-weight: bold;">class</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">synchronize loading of the correct classloader.</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #9564bf;">(</span>callerCL == <span style="color: #a45bad;">null</span><span style="color: #9564bf;">)</span> <span style="color: #9564bf;">{</span>
      callerCL = Thread.currentThread<span style="color: #24a222;">()</span>.getContextClassLoader<span style="color: #24a222;">()</span>;
    <span style="color: #9564bf;">}</span>
  <span style="color: #d8241f;">}</span>

  <span style="color: #4f97d7; font-weight: bold;">if</span><span style="color: #d8241f;">(</span>url == <span style="color: #a45bad;">null</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">throw</span> <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">SQLException</span><span style="color: #9564bf;">(</span><span style="color: #2d9574;">"The url cannot be null"</span>, <span style="color: #2d9574;">"08001"</span><span style="color: #9564bf;">)</span>;
  <span style="color: #d8241f;">}</span>

  println<span style="color: #d8241f;">(</span><span style="color: #2d9574;">"DriverManager.getConnection(\""</span> + url + <span style="color: #2d9574;">"\")"</span><span style="color: #d8241f;">)</span>;

  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Walk through the loaded registeredDrivers attempting to make a connection.</span>
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Remember the first exception that gets raised so we can reraise it.</span>
  <span style="color: #ce537a; font-weight: bold;">SQLException</span> <span style="color: #7590db;">reason</span> = <span style="color: #a45bad;">null</span>;

  <span style="color: #4f97d7; font-weight: bold;">for</span><span style="color: #d8241f;">(</span><span style="color: #ce537a; font-weight: bold;">DriverInfo</span> <span style="color: #7590db;">aDriver</span> : registeredDrivers<span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">If the caller does not have permission to load the driver then</span>
    <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">skip it.</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span><span style="color: #9564bf;">(</span>isDriverAllowed<span style="color: #24a222;">(</span>aDriver.driver, callerCL<span style="color: #24a222;">)</span><span style="color: #9564bf;">)</span> <span style="color: #9564bf;">{</span>
      <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #24a222;">{</span>
        println<span style="color: #ff7f00;">(</span><span style="color: #2d9574;">"    trying "</span> + aDriver.driver.getClass<span style="color: #1776b6;">()</span>.getName<span style="color: #1776b6;">()</span><span style="color: #ff7f00;">)</span>;
        <span style="color: #ce537a; font-weight: bold;">Connection</span> <span style="color: #7590db;">con</span> = aDriver.driver.connect<span style="color: #ff7f00;">(</span>url, info<span style="color: #ff7f00;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #ff7f00;">(</span>con != <span style="color: #a45bad;">null</span><span style="color: #ff7f00;">)</span> <span style="color: #ff7f00;">{</span>
          <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Success!</span>
          println<span style="color: #1776b6;">(</span><span style="color: #2d9574;">"getConnection returning "</span> + aDriver.driver.getClass<span style="color: #00bed1;">()</span>.getName<span style="color: #00bed1;">()</span><span style="color: #1776b6;">)</span>;
          <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #1776b6;">(</span>con<span style="color: #1776b6;">)</span>;
        <span style="color: #ff7f00;">}</span>
      <span style="color: #24a222;">}</span> <span style="color: #4f97d7; font-weight: bold;">catch</span> <span style="color: #24a222;">(</span><span style="color: #ce537a; font-weight: bold;">SQLException</span> <span style="color: #7590db;">ex</span><span style="color: #24a222;">)</span> <span style="color: #24a222;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #ff7f00;">(</span>reason == <span style="color: #a45bad;">null</span><span style="color: #ff7f00;">)</span> <span style="color: #ff7f00;">{</span>
          reason = ex;
        <span style="color: #ff7f00;">}</span>
      <span style="color: #24a222;">}</span>

    <span style="color: #9564bf;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #9564bf;">{</span>
      println<span style="color: #24a222;">(</span><span style="color: #2d9574;">"    skipping: "</span> + aDriver.getClass<span style="color: #ff7f00;">()</span>.getName<span style="color: #ff7f00;">()</span><span style="color: #24a222;">)</span>;
    <span style="color: #9564bf;">}</span>

  <span style="color: #d8241f;">}</span>

  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">if we got here nobody could connect.</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #d8241f;">(</span>reason != <span style="color: #a45bad;">null</span><span style="color: #d8241f;">)</span>    <span style="color: #d8241f;">{</span>
    println<span style="color: #9564bf;">(</span><span style="color: #2d9574;">"getConnection failed: "</span> + reason<span style="color: #9564bf;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">throw</span> reason;
  <span style="color: #d8241f;">}</span>

  println<span style="color: #d8241f;">(</span><span style="color: #2d9574;">"getConnection: no suitable driver found for "</span>+ url<span style="color: #d8241f;">)</span>;
  <span style="color: #4f97d7; font-weight: bold;">throw</span> <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">SQLException</span><span style="color: #d8241f;">(</span><span style="color: #2d9574;">"No suitable driver found for "</span>+ url, <span style="color: #2d9574;">"08001"</span><span style="color: #d8241f;">)</span>;
<span style="color: #8d5649;">}</span>
</pre>
</div></li>
</ol>
</div>
</div>
</div>
