article/jdbc-source-codes.html

<div id="outline-container-orgd93aa4e" class="outline-2">
<h2 id="orgd93aa4e"><span class="section-number-2">2</span> Spring 中的 <code>JdbcTemplate</code></h2>
<div class="outline-text-2" id="text-2">
<p>
Spring 框架中对 JDBC 的操作进行了封装，提供可以方便操作数据库的 <code>JdbcTemplate</code> 类
</p>
</div>
<div id="outline-container-orgc59eab2" class="outline-3">
<h3 id="orgc59eab2"><span class="section-number-3">2.1</span> 数据库配置类</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">package</span> io.github.jeanhwea.app09_jdbc.<span style="color: #a45bad;">beans</span>;

<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">javax</span>.<span style="color: #a45bad;">sql</span>.<span style="color: #ce537a; font-weight: bold;">DataSource</span>;
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">org</span>.<span style="color: #a45bad;">springframework</span>.<span style="color: #a45bad;">context</span>.<span style="color: #a45bad;">annotation</span>.<span style="color: #ce537a; font-weight: bold;">Bean</span>;
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">org</span>.<span style="color: #a45bad;">springframework</span>.<span style="color: #a45bad;">context</span>.<span style="color: #a45bad;">annotation</span>.<span style="color: #ce537a; font-weight: bold;">Configuration</span>;
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">org</span>.<span style="color: #a45bad;">springframework</span>.<span style="color: #a45bad;">jdbc</span>.<span style="color: #a45bad;">datasource</span>.<span style="color: #ce537a; font-weight: bold;">DriverManagerDataSource</span>;

<span style="color: #a45bad;">@Configuration</span>
<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">DataSourceConfig</span> <span style="color: #8d5649;">{</span>

  <span style="color: #a45bad;">@Bean</span>
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">DataSource</span> <span style="color: #bc6ec5; font-weight: bold;">getDataSource</span><span style="color: #d8241f;">()</span> <span style="color: #d8241f;">{</span>
    <span style="color: #ce537a; font-weight: bold;">DriverManagerDataSource</span> <span style="color: #7590db;">dataSource</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">DriverManagerDataSource</span><span style="color: #9564bf;">()</span>;
    dataSource.setDriverClassName<span style="color: #9564bf;">(</span><span style="color: #2d9574;">"com.mysql.jdbc.Driver"</span><span style="color: #9564bf;">)</span>;
    dataSource.setUrl<span style="color: #9564bf;">(</span><span style="color: #2d9574;">"jdbc:mysql://localhost:3306/db01"</span><span style="color: #9564bf;">)</span>;
    dataSource.setUsername<span style="color: #9564bf;">(</span><span style="color: #2d9574;">"user01"</span><span style="color: #9564bf;">)</span>;
    dataSource.setPassword<span style="color: #9564bf;">(</span><span style="color: #2d9574;">"pass01"</span><span style="color: #9564bf;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">return</span> dataSource;
  <span style="color: #d8241f;">}</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0da55a1" class="outline-3">
<h3 id="org0da55a1"><span class="section-number-3">2.2</span> 添加实体及 Mapper</h3>
<div class="outline-text-3" id="text-2-2">
<p>
实体类
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">package</span> io.github.jeanhwea.app09_jdbc.<span style="color: #a45bad;">beans</span>;

<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Employee</span> <span style="color: #8d5649;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">Long</span> <span style="color: #7590db;">id</span>;
  <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">name</span>;

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #bc6ec5; font-weight: bold;">Employee</span><span style="color: #d8241f;">(</span><span style="color: #ce537a; font-weight: bold;">Long</span> <span style="color: #7590db;">id</span>, <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">name</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">this</span>.id = id;
    <span style="color: #4f97d7; font-weight: bold;">this</span>.name = name;
  <span style="color: #d8241f;">}</span>

    <span style="color: #a45bad;">@Override</span>
    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #bc6ec5; font-weight: bold;">toString</span><span style="color: #d8241f;">()</span> <span style="color: #d8241f;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #2d9574;">"Employee["</span> + <span style="color: #4f97d7; font-weight: bold;">this</span>.id +<span style="color: #2d9574;">"]"</span>;
    <span style="color: #d8241f;">}</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>

<p>
对象的 Mapper
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">package</span> io.github.jeanhwea.app09_jdbc.<span style="color: #a45bad;">beans</span>;

<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">sql</span>.<span style="color: #ce537a; font-weight: bold;">ResultSet</span>;
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">sql</span>.<span style="color: #ce537a; font-weight: bold;">SQLException</span>;
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">org</span>.<span style="color: #a45bad;">springframework</span>.<span style="color: #a45bad;">jdbc</span>.<span style="color: #a45bad;">core</span>.<span style="color: #ce537a; font-weight: bold;">RowMapper</span>;

<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">EmployeeRowMapper</span> <span style="color: #4f97d7; font-weight: bold;">implements</span> <span style="color: #ce537a; font-weight: bold;">RowMapper</span><span style="color: #8d5649;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Employee</span><span style="color: #8d5649;">&gt;</span> <span style="color: #8d5649;">{</span>
  <span style="color: #a45bad;">@Override</span>
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">Employee</span> <span style="color: #bc6ec5; font-weight: bold;">mapRow</span><span style="color: #d8241f;">(</span><span style="color: #ce537a; font-weight: bold;">ResultSet</span> <span style="color: #7590db;">rs</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">rowNum</span><span style="color: #d8241f;">)</span> <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">SQLException</span> <span style="color: #d8241f;">{</span>
    <span style="color: #ce537a; font-weight: bold;">Employee</span> <span style="color: #7590db;">empl</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Employee</span><span style="color: #9564bf;">(</span>rs.getLong<span style="color: #24a222;">(</span><span style="color: #2d9574;">"G_ID"</span><span style="color: #24a222;">)</span>, rs.getString<span style="color: #24a222;">(</span><span style="color: #2d9574;">"EMPL_NAME"</span><span style="color: #24a222;">)</span><span style="color: #9564bf;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">return</span> empl;
  <span style="color: #d8241f;">}</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>
