article/jdbc-source-codes.org
** 服务类 Service
   #+BEGIN_SRC java
     ////////////////////////////////////////////////////////////////////////////////
     // 服务接口
     ////////////////////////////////////////////////////////////////////////////////
     package io.github.jeanhwea.app09_jdbc.beans;

     import java.util.List;
     import org.springframework.stereotype.Component;

     @Component
     public interface EmployeeService {
       List<Employee> getAll();
     }

     ////////////////////////////////////////////////////////////////////////////////
     // 实现类
     ////////////////////////////////////////////////////////////////////////////////
     package io.github.jeanhwea.app09_jdbc.beans;

     import java.util.List;
     import javax.sql.DataSource;
     import org.springframework.jdbc.core.JdbcTemplate;
     import org.springframework.stereotype.Component;

     @Component
     public class EmployeeServiceImpl implements EmployeeService {

       private JdbcTemplate jdbcTemplate;

       public void setDataSource(DataSource dataSource) {
         this.jdbcTemplate = new JdbcTemplate(dataSource);
       }

       public EmployeeServiceImpl(DataSource dataSource) {
         this.setDataSource(dataSource);
       }

       @Override
       @SuppressWarnings("unchecked")
       public List<Employee> getAll() {
         List<Employee> employees =
             jdbcTemplate.query("select * from TB_BASE_EMPL", new EmployeeRowMapper());
         return employees;
       }
     }
   #+END_SRC
** 主函数
   #+BEGIN_SRC java
     package io.github.jeanhwea.app09_jdbc;

     import io.github.jeanhwea.app09_jdbc.beans.Employee;
     import io.github.jeanhwea.app09_jdbc.beans.EmployeeService;
     import java.util.List;
     import org.springframework.context.annotation.AnnotationConfigApplicationContext;

     public class MyApp09 {

       public static void main(String[] args) {
         String pkgname = MyApp09.class.getPackage().getName();
         System.out.println(pkgname);
         AnnotationConfigApplicationContext ctx = new AnnotationConfigApplicationContext(pkgname);
         EmployeeService employeeService = ctx.getBean("employeeServiceImpl", EmployeeService.class);
         List<Employee> employeeList = employeeService.getAll();
         System.out.println(employeeList);
       }
     }
   #+END_SRC

* 代码实现
