article/jdbc-source-codes.html

<div id="outline-container-orgdce52d8" class="outline-3">
<h3 id="orgdce52d8"><span class="section-number-3">2.3</span> 服务类 Service</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #93a1a1; font-style: italic;">////////////////////////////////////////////////////////////////////////////////</span>
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#26381;&#21153;&#25509;&#21475;</span>
<span style="color: #93a1a1; font-style: italic;">////////////////////////////////////////////////////////////////////////////////</span>
<span style="color: #4f97d7; font-weight: bold;">package</span> io.github.jeanhwea.app09_jdbc.<span style="color: #a45bad;">beans</span>;

<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">util</span>.<span style="color: #ce537a; font-weight: bold;">List</span>;
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">org</span>.<span style="color: #a45bad;">springframework</span>.<span style="color: #a45bad;">stereotype</span>.<span style="color: #ce537a; font-weight: bold;">Component</span>;

<span style="color: #a45bad;">@Component</span>
<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">interface</span> <span style="color: #ce537a; font-weight: bold;">EmployeeService</span> <span style="color: #8d5649;">{</span>
  <span style="color: #ce537a; font-weight: bold;">List</span><span style="color: #d8241f;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Employee</span><span style="color: #d8241f;">&gt;</span> <span style="color: #bc6ec5; font-weight: bold;">getAll</span><span style="color: #d8241f;">()</span>;
<span style="color: #8d5649;">}</span>

<span style="color: #93a1a1; font-style: italic;">////////////////////////////////////////////////////////////////////////////////</span>
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#23454;&#29616;&#31867;</span>
<span style="color: #93a1a1; font-style: italic;">////////////////////////////////////////////////////////////////////////////////</span>
<span style="color: #4f97d7; font-weight: bold;">package</span> io.github.jeanhwea.app09_jdbc.<span style="color: #a45bad;">beans</span>;

<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">util</span>.<span style="color: #ce537a; font-weight: bold;">List</span>;
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">javax</span>.<span style="color: #a45bad;">sql</span>.<span style="color: #ce537a; font-weight: bold;">DataSource</span>;
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">org</span>.<span style="color: #a45bad;">springframework</span>.<span style="color: #a45bad;">jdbc</span>.<span style="color: #a45bad;">core</span>.<span style="color: #ce537a; font-weight: bold;">JdbcTemplate</span>;
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">org</span>.<span style="color: #a45bad;">springframework</span>.<span style="color: #a45bad;">stereotype</span>.<span style="color: #ce537a; font-weight: bold;">Component</span>;

<span style="color: #a45bad;">@Component</span>
<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">EmployeeServiceImpl</span> <span style="color: #4f97d7; font-weight: bold;">implements</span> <span style="color: #ce537a; font-weight: bold;">EmployeeService</span> <span style="color: #8d5649;">{</span>

  <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">JdbcTemplate</span> <span style="color: #7590db;">jdbcTemplate</span>;

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">setDataSource</span><span style="color: #d8241f;">(</span><span style="color: #ce537a; font-weight: bold;">DataSource</span> <span style="color: #7590db;">dataSource</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">this</span>.jdbcTemplate = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">JdbcTemplate</span><span style="color: #9564bf;">(</span>dataSource<span style="color: #9564bf;">)</span>;
  <span style="color: #d8241f;">}</span>

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #bc6ec5; font-weight: bold;">EmployeeServiceImpl</span><span style="color: #d8241f;">(</span><span style="color: #ce537a; font-weight: bold;">DataSource</span> <span style="color: #7590db;">dataSource</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">this</span>.setDataSource<span style="color: #9564bf;">(</span>dataSource<span style="color: #9564bf;">)</span>;
  <span style="color: #d8241f;">}</span>

  <span style="color: #a45bad;">@Override</span>
  <span style="color: #a45bad;">@SuppressWarnings</span><span style="color: #d8241f;">(</span><span style="color: #2d9574;">"unchecked"</span><span style="color: #d8241f;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">List</span><span style="color: #d8241f;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Employee</span><span style="color: #d8241f;">&gt;</span> <span style="color: #bc6ec5; font-weight: bold;">getAll</span><span style="color: #d8241f;">()</span> <span style="color: #d8241f;">{</span>
    <span style="color: #ce537a; font-weight: bold;">List</span><span style="color: #9564bf;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Employee</span><span style="color: #9564bf;">&gt;</span> <span style="color: #7590db;">employees</span> =
        jdbcTemplate.query<span style="color: #9564bf;">(</span><span style="color: #2d9574;">"select * from TB_BASE_EMPL"</span>, <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">EmployeeRowMapper</span><span style="color: #24a222;">()</span><span style="color: #9564bf;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">return</span> employees;
  <span style="color: #d8241f;">}</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0bab6a5" class="outline-3">
<h3 id="org0bab6a5"><span class="section-number-3">2.4</span> 主函数</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">package</span> io.github.jeanhwea.<span style="color: #a45bad;">app09_jdbc</span>;

<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">io</span>.<span style="color: #a45bad;">github</span>.<span style="color: #a45bad;">jeanhwea</span>.<span style="color: #a45bad;">app09_jdbc</span>.<span style="color: #a45bad;">beans</span>.<span style="color: #ce537a; font-weight: bold;">Employee</span>;
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">io</span>.<span style="color: #a45bad;">github</span>.<span style="color: #a45bad;">jeanhwea</span>.<span style="color: #a45bad;">app09_jdbc</span>.<span style="color: #a45bad;">beans</span>.<span style="color: #ce537a; font-weight: bold;">EmployeeService</span>;
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">util</span>.<span style="color: #ce537a; font-weight: bold;">List</span>;
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">org</span>.<span style="color: #a45bad;">springframework</span>.<span style="color: #a45bad;">context</span>.<span style="color: #a45bad;">annotation</span>.<span style="color: #ce537a; font-weight: bold;">AnnotationConfigApplicationContext</span>;

<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">MyApp09</span> <span style="color: #8d5649;">{</span>

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #d8241f;">(</span><span style="color: #ce537a; font-weight: bold;">String</span><span style="color: #9564bf;">[]</span> <span style="color: #7590db;">args</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">pkgname</span> = MyApp09.<span style="color: #4f97d7; font-weight: bold;">class</span>.getPackage<span style="color: #9564bf;">()</span>.getName<span style="color: #9564bf;">()</span>;
    System.out.println<span style="color: #9564bf;">(</span>pkgname<span style="color: #9564bf;">)</span>;
    <span style="color: #ce537a; font-weight: bold;">AnnotationConfigApplicationContext</span> <span style="color: #7590db;">ctx</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">AnnotationConfigApplicationContext</span><span style="color: #9564bf;">(</span>pkgname<span style="color: #9564bf;">)</span>;
    <span style="color: #ce537a; font-weight: bold;">EmployeeService</span> <span style="color: #7590db;">employeeService</span> = ctx.getBean<span style="color: #9564bf;">(</span><span style="color: #2d9574;">"employeeServiceImpl"</span>, EmployeeService.<span style="color: #4f97d7; font-weight: bold;">class</span><span style="color: #9564bf;">)</span>;
    <span style="color: #ce537a; font-weight: bold;">List</span><span style="color: #9564bf;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Employee</span><span style="color: #9564bf;">&gt;</span> <span style="color: #7590db;">employeeList</span> = employeeService.getAll<span style="color: #9564bf;">()</span>;
    System.out.println<span style="color: #9564bf;">(</span>employeeList<span style="color: #9564bf;">)</span>;
  <span style="color: #d8241f;">}</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>
</div>
