article/jdbc-source-codes.org
** ~JdbcTemplate~ 类
   ~JdbcTemplate~ 是操作数据的主要类，它的继承关系如下
   #+BEGIN_SRC java
     org.springframework.jdbc.core
     Class JdbcTemplate

         java.lang.Object
             org.springframework.jdbc.support.JdbcAccessor
                 org.springframework.jdbc.core.JdbcTemplate

         All Implemented Interfaces:
             org.springframework.beans.factory.InitializingBean, JdbcOperations
   #+END_SRC
   1. ~JdbcAccessor~ 类实现了 ~InitializingBean~ 接口
      - 该类中包含数据库的连接 DataSource
      - 该类实现了对数据库连接的操作
        + ~getDataSource()~ 获取 DataSource
        + ~setDataSource()~ 设置 DataSource
   2. ~JdbcTemplate~ 类实现了操作数据方法，提供 SQL 交互方法
      - ~execute(...)~ 系列方法
      - ~update(...)~ 系列方法
      - ~query(...)~, ~queryForMap(...)~, ~queryForObject(...)~ 方法

