article/jdbc-source-codes.html

<div id="outline-container-org77b33d6" class="outline-2">
<h2 id="org77b33d6"><span class="section-number-2">3</span> 代码实现</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2c91a3d" class="outline-3">
<h3 id="org2c91a3d"><span class="section-number-3">3.1</span> <code>JdbcTemplate</code> 类</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<code>JdbcTemplate</code> 是操作数据的主要类，它的继承关系如下
</p>
<div class="org-src-container">
<pre class="src src-java">org.springframework.jdbc.core
Class JdbcTemplate

    <span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">lang</span>.Object
        <span style="color: #a45bad;">org</span>.<span style="color: #a45bad;">springframework</span>.<span style="color: #a45bad;">jdbc</span>.<span style="color: #a45bad;">support</span>.JdbcAccessor
            <span style="color: #a45bad;">org</span>.<span style="color: #a45bad;">springframework</span>.<span style="color: #a45bad;">jdbc</span>.<span style="color: #a45bad;">core</span>.JdbcTemplate

    All <span style="color: #ce537a; font-weight: bold;">Implemented</span> <span style="color: #7590db;">Interfaces</span>:
        <span style="color: #a45bad;">org</span>.<span style="color: #a45bad;">springframework</span>.<span style="color: #a45bad;">beans</span>.<span style="color: #a45bad;">factory</span>.InitializingBean, <span style="color: #7590db;">JdbcOperations</span>
</pre>
</div>
<ol class="org-ol">
<li><code>JdbcAccessor</code> 类实现了 <code>InitializingBean</code> 接口
<ul class="org-ul">
<li>该类中包含数据库的连接 DataSource</li>
<li>该类实现了对数据库连接的操作
<ul class="org-ul">
<li><code>getDataSource()</code> 获取 DataSource</li>
<li><code>setDataSource()</code> 设置 DataSource</li>
</ul></li>
</ul></li>
<li><code>JdbcTemplate</code> 类实现了操作数据方法，提供 SQL 交互方法
<ul class="org-ul">
<li><code>execute(...)</code> 系列方法</li>
<li><code>update(...)</code> 系列方法</li>
<li><code>query(...)</code>, <code>queryForMap(...)</code>, <code>queryForObject(...)</code> 方法</li>
</ul></li>
</ol>
</div>
</div>
