article/jdbc-source-codes.org
** 获取数据库连接
   在数据库中获取连接的调用栈如下
   #+BEGIN_SRC text
     doGetConnection:104, DataSourceUtils (org.springframework.jdbc.datasource)
     getConnection:79, DataSourceUtils (org.springframework.jdbc.datasource)
     execute:371, JdbcTemplate (org.springframework.jdbc.core)
     query:452, JdbcTemplate (org.springframework.jdbc.core)
     query:462, JdbcTemplate (org.springframework.jdbc.core)
     getAll:25, EmployeeServiceImpl (io.github.jeanhwea.app09_jdbc.beans)
     main:15, MyApp09 (io.github.jeanhwea.app09_jdbc)
   #+END_SRC

   其中的 ~doGetConnection(...)~ 方法完成对连接获取操作
   #+BEGIN_SRC java
     /**
      ,* Actually obtain a JDBC Connection from the given DataSource.
      ,* Same as {@link #getConnection}, but throwing the original SQLException.
      ,* <p>Is aware of a corresponding Connection bound to the current thread, for example
      ,* when using {@link DataSourceTransactionManager}. Will bind a Connection to the thread
      ,* if transaction synchronization is active (e.g. if in a JTA transaction).
      ,* <p>Directly accessed by {@link TransactionAwareDataSourceProxy}.
      ,* @param dataSource the DataSource to obtain Connections from
      ,* @return a JDBC Connection from the given DataSource
      ,* @throws SQLException if thrown by JDBC methods
      ,* @see #doReleaseConnection
      ,*/
     public static Connection doGetConnection(DataSource dataSource) throws SQLException {
       Assert.notNull(dataSource, "No DataSource specified");

       ConnectionHolder conHolder = (ConnectionHolder) TransactionSynchronizationManager.getResource(dataSource);
       if (conHolder != null && (conHolder.hasConnection() || conHolder.isSynchronizedWithTransaction())) {
         conHolder.requested();
         if (!conHolder.hasConnection()) {
           logger.debug("Fetching resumed JDBC Connection from DataSource");
           conHolder.setConnection(fetchConnection(dataSource));
         }
         return conHolder.getConnection();
       }
       // Else we either got no holder or an empty thread-bound holder here.

       logger.debug("Fetching JDBC Connection from DataSource");
       Connection con = fetchConnection(dataSource);

       // 当前线程是否支持同步
       if (TransactionSynchronizationManager.isSynchronizationActive()) {
         try {
           // Use same Connection for further JDBC actions within the transaction.
           // Thread-bound object will get removed by synchronization at transaction completion.
           // 在同一事务中，JDBC 的连接需要保持一致
           ConnectionHolder holderToUse = conHolder;
           if (holderToUse == null) {
             holderToUse = new ConnectionHolder(con);
           }
           else {
             holderToUse.setConnection(con);
           }
           // 这里记录数据连接的引用数量
           holderToUse.requested();
           TransactionSynchronizationManager.registerSynchronization(
                                                                     new ConnectionSynchronization(holderToUse, dataSource));
           holderToUse.setSynchronizedWithTransaction(true);
           if (holderToUse != conHolder) {
             TransactionSynchronizationManager.bindResource(dataSource, holderToUse);
           }
         }
         catch (RuntimeException ex) {
           // Unexpected exception from external delegation call -> close Connection and rethrow.
           releaseConnection(con, dataSource);
           throw ex;
         }
       }

       return con;
     }
   #+END_SRC

