article/jdbc-source-codes.html

<div id="outline-container-org5678806" class="outline-3">
<h3 id="org5678806"><span class="section-number-3">3.2</span> 获取数据库连接</h3>
<div class="outline-text-3" id="text-3-2">
<p>
在数据库中获取连接的调用栈如下
</p>
<div class="org-src-container">
<pre class="src src-text">doGetConnection:104, DataSourceUtils (org.springframework.jdbc.datasource)
getConnection:79, DataSourceUtils (org.springframework.jdbc.datasource)
execute:371, JdbcTemplate (org.springframework.jdbc.core)
query:452, JdbcTemplate (org.springframework.jdbc.core)
query:462, JdbcTemplate (org.springframework.jdbc.core)
getAll:25, EmployeeServiceImpl (io.github.jeanhwea.app09_jdbc.beans)
main:15, MyApp09 (io.github.jeanhwea.app09_jdbc)
</pre>
</div>

<p>
其中的 <code>doGetConnection(...)</code> 方法完成对连接获取操作
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #9f8766;">/**</span>
<span style="color: #9f8766;"> * Actually obtain a JDBC Connection from the given DataSource.</span>
<span style="color: #9f8766;"> * Same as </span><span style="color: #a45bad;">{@link #getConnection}</span><span style="color: #9f8766;">, but throwing the original SQLException.</span>
<span style="color: #9f8766;"> * </span><span style="color: #a45bad;">&lt;p&gt;</span><span style="color: #9f8766;">Is aware of a corresponding Connection bound to the current thread, for example</span>
<span style="color: #9f8766;"> * when using </span><span style="color: #a45bad;">{@link DataSourceTransactionManager}</span><span style="color: #9f8766;">. Will bind a Connection to the thread</span>
<span style="color: #9f8766;"> * if transaction synchronization is active (e.g. if in a JTA transaction).</span>
<span style="color: #9f8766;"> * </span><span style="color: #a45bad;">&lt;p&gt;</span><span style="color: #9f8766;">Directly accessed by </span><span style="color: #a45bad;">{@link TransactionAwareDataSourceProxy}</span><span style="color: #9f8766;">.</span>
<span style="color: #9f8766;"> * </span><span style="color: #a45bad;">@param</span><span style="color: #9f8766;"> dataSource the DataSource to obtain Connections from</span>
<span style="color: #9f8766;"> * </span><span style="color: #a45bad;">@return</span><span style="color: #9f8766;"> a JDBC Connection from the given DataSource</span>
<span style="color: #9f8766;"> * </span><span style="color: #a45bad;">@throws</span><span style="color: #9f8766;"> SQLException if thrown by JDBC methods</span>
<span style="color: #9f8766;"> * </span><span style="color: #a45bad;">@see</span><span style="color: #9f8766;"> #doReleaseConnection</span>
<span style="color: #9f8766;"> */</span>
<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">Connection</span> <span style="color: #bc6ec5; font-weight: bold;">doGetConnection</span><span style="color: #8d5649;">(</span><span style="color: #ce537a; font-weight: bold;">DataSource</span> <span style="color: #7590db;">dataSource</span><span style="color: #8d5649;">)</span> <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">SQLException</span> <span style="color: #8d5649;">{</span>
  Assert.notNull<span style="color: #d8241f;">(</span>dataSource, <span style="color: #2d9574;">"No DataSource specified"</span><span style="color: #d8241f;">)</span>;

  <span style="color: #ce537a; font-weight: bold;">ConnectionHolder</span> <span style="color: #7590db;">conHolder</span> = <span style="color: #d8241f;">(</span><span style="color: #ce537a; font-weight: bold;">ConnectionHolder</span><span style="color: #d8241f;">)</span> TransactionSynchronizationManager.getResource<span style="color: #d8241f;">(</span>dataSource<span style="color: #d8241f;">)</span>;
  <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #d8241f;">(</span>conHolder != <span style="color: #a45bad;">null</span> &amp;&amp; <span style="color: #9564bf;">(</span>conHolder.hasConnection<span style="color: #24a222;">()</span> || conHolder.isSynchronizedWithTransaction<span style="color: #24a222;">()</span><span style="color: #9564bf;">)</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    conHolder.requested<span style="color: #9564bf;">()</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #9564bf;">(</span><span style="color: #a45bad;">!</span>conHolder.hasConnection<span style="color: #24a222;">()</span><span style="color: #9564bf;">)</span> <span style="color: #9564bf;">{</span>
      logger.debug<span style="color: #24a222;">(</span><span style="color: #2d9574;">"Fetching resumed JDBC Connection from DataSource"</span><span style="color: #24a222;">)</span>;
      conHolder.setConnection<span style="color: #24a222;">(</span>fetchConnection<span style="color: #ff7f00;">(</span>dataSource<span style="color: #ff7f00;">)</span><span style="color: #24a222;">)</span>;
    <span style="color: #9564bf;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> conHolder.getConnection<span style="color: #9564bf;">()</span>;
  <span style="color: #d8241f;">}</span>
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Else we either got no holder or an empty thread-bound holder here.</span>

  logger.debug<span style="color: #d8241f;">(</span><span style="color: #2d9574;">"Fetching JDBC Connection from DataSource"</span><span style="color: #d8241f;">)</span>;
  <span style="color: #ce537a; font-weight: bold;">Connection</span> <span style="color: #7590db;">con</span> = fetchConnection<span style="color: #d8241f;">(</span>dataSource<span style="color: #d8241f;">)</span>;

  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#24403;&#21069;&#32447;&#31243;&#26159;&#21542;&#25903;&#25345;&#21516;&#27493;</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #d8241f;">(</span>TransactionSynchronizationManager.isSynchronizationActive<span style="color: #9564bf;">()</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #9564bf;">{</span>
      <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Use same Connection for further JDBC actions within the transaction.</span>
      <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Thread-bound object will get removed by synchronization at transaction completion.</span>
      <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#22312;&#21516;&#19968;&#20107;&#21153;&#20013;&#65292;JDBC &#30340;&#36830;&#25509;&#38656;&#35201;&#20445;&#25345;&#19968;&#33268;</span>
      <span style="color: #ce537a; font-weight: bold;">ConnectionHolder</span> <span style="color: #7590db;">holderToUse</span> = conHolder;
      <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #24a222;">(</span>holderToUse == <span style="color: #a45bad;">null</span><span style="color: #24a222;">)</span> <span style="color: #24a222;">{</span>
        holderToUse = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">ConnectionHolder</span><span style="color: #ff7f00;">(</span>con<span style="color: #ff7f00;">)</span>;
      <span style="color: #24a222;">}</span>
      <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #24a222;">{</span>
        holderToUse.setConnection<span style="color: #ff7f00;">(</span>con<span style="color: #ff7f00;">)</span>;
      <span style="color: #24a222;">}</span>
      <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#36825;&#37324;&#35760;&#24405;&#25968;&#25454;&#36830;&#25509;&#30340;&#24341;&#29992;&#25968;&#37327;</span>
      holderToUse.requested<span style="color: #24a222;">()</span>;
      TransactionSynchronizationManager.registerSynchronization<span style="color: #24a222;">(</span>
                                                                <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">ConnectionSynchronization</span><span style="color: #ff7f00;">(</span>holderToUse, dataSource<span style="color: #ff7f00;">)</span><span style="color: #24a222;">)</span>;
      holderToUse.setSynchronizedWithTransaction<span style="color: #24a222;">(</span><span style="color: #a45bad;">true</span><span style="color: #24a222;">)</span>;
      <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #24a222;">(</span>holderToUse != conHolder<span style="color: #24a222;">)</span> <span style="color: #24a222;">{</span>
        TransactionSynchronizationManager.bindResource<span style="color: #ff7f00;">(</span>dataSource, holderToUse<span style="color: #ff7f00;">)</span>;
      <span style="color: #24a222;">}</span>
    <span style="color: #9564bf;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">catch</span> <span style="color: #9564bf;">(</span><span style="color: #ce537a; font-weight: bold;">RuntimeException</span> <span style="color: #7590db;">ex</span><span style="color: #9564bf;">)</span> <span style="color: #9564bf;">{</span>
      <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Unexpected exception from external delegation call -&gt; close Connection and rethrow.</span>
      releaseConnection<span style="color: #24a222;">(</span>con, dataSource<span style="color: #24a222;">)</span>;
      <span style="color: #4f97d7; font-weight: bold;">throw</span> ex;
    <span style="color: #9564bf;">}</span>
  <span style="color: #d8241f;">}</span>

  <span style="color: #4f97d7; font-weight: bold;">return</span> con;
<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>
