article/jdbc-source-codes.org
** 执行 SQL: ~execute(...)~ 方法
   在数据库中执行 SQL 的逻辑如下
   #+BEGIN_SRC java
     //-------------------------------------------------------------------------
     // Methods dealing with static SQL (java.sql.Statement)
     //-------------------------------------------------------------------------

     @Override
     @Nullable
     public <T> T execute(StatementCallback<T> action) throws DataAccessException {
       Assert.notNull(action, "Callback object must not be null");

       Connection con = DataSourceUtils.getConnection(obtainDataSource());
       Statement stmt = null;
       try {
         // 执行 SQL, 并返回结果
         stmt = con.createStatement();
         applyStatementSettings(stmt);
         T result = action.doInStatement(stmt);
         handleWarnings(stmt);
         return result;
       }
       catch (SQLException ex) {
         // Release Connection early, to avoid potential connection pool deadlock
         // in the case when the exception translator hasn't been initialized yet.
         String sql = getSql(action);
         JdbcUtils.closeStatement(stmt);
         stmt = null;
         DataSourceUtils.releaseConnection(con, getDataSource());
         con = null;
         throw translateException("StatementCallback", sql, ex);
       }
       finally {
         JdbcUtils.closeStatement(stmt);
         DataSourceUtils.releaseConnection(con, getDataSource());
       }
     }
   #+END_SRC
   1. ~applyStatementSettings(...)~ 用户设置输入参数
      - fectchSize 减少网络交互次数
      - maxRows 获取结果集的最大行数
   2. ~action.doInStatement(...)~ 是调用 ~StatementCallback~ 类型的回调函数
      #+BEGIN_SRC java
        @FunctionalInterface
        public interface StatementCallback<T> {
          @Nullable
          T doInStatement(Statement stmt) throws SQLException, DataAccessException;
        }
      #+END_SRC
   3. ~handleWarnings(...)~ 进行告警处理
      - 这里的告警默认输出异常信息
      - 可以通过配置抛出 ~SQLWarningException~ 异常
   4. ~DataSourceUtils.releaseConnection(...)~ 释放连接

** 数据库更新: ~update(...)~ 方法
   数据库更新和执行 SQL 类似，这里需要熟悉 ~PreparedStatement~ 接口，它是一预编
   译的 SQL 语句
   #+BEGIN_SRC java
     PreparedStatement pstmt = con.prepareStatement("UPDATE EMPLOYEES SET SALARY = ? WHERE ID = ?");
     pstmt.setBigDecimal(1, 153833.00);
     pstmt.setInt(2, 110592);
   #+END_SRC

   实际的 ~update(...)~ 方法实现如下
   #+BEGIN_SRC java
     protected int update(final PreparedStatementCreator psc, @Nullable final PreparedStatementSetter pss)
       throws DataAccessException {

       logger.debug("Executing prepared SQL update");

       return updateCount(execute(psc, ps -> {
             try {
               if (pss != null) {
                 // 设置 PreparedStatement 的实际值
                 pss.setValues(ps);
               }
               // 调用更新语句
               int rows = ps.executeUpdate();
               if (logger.isTraceEnabled()) {
                 logger.trace("SQL update affected " + rows + " rows");
               }
               return rows;
             }
             finally {
               if (pss instanceof ParameterDisposer) {
                 ((ParameterDisposer) pss).cleanupParameters();
               }
             }
           }));
     }
   #+END_SRC
