article/jdbc-source-codes.html

<div id="outline-container-orgfeb88d7" class="outline-3">
<h3 id="orgfeb88d7"><span class="section-number-3">3.3</span> 执行 SQL: <code>execute(...)</code> 方法</h3>
<div class="outline-text-3" id="text-3-3">
<p>
在数据库中执行 SQL 的逻辑如下
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #93a1a1; font-style: italic;">//</span><span style="color: #2aa1ae; background-color: #292e34;">-------------------------------------------------------------------------</span>
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Methods dealing with static SQL (java.sql.Statement)</span>
<span style="color: #93a1a1; font-style: italic;">//</span><span style="color: #2aa1ae; background-color: #292e34;">-------------------------------------------------------------------------</span>

<span style="color: #a45bad;">@Override</span>
<span style="color: #a45bad;">@Nullable</span>
<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #8d5649;">&lt;</span><span style="color: #ce537a; font-weight: bold;">T</span><span style="color: #8d5649;">&gt;</span> <span style="color: #ce537a; font-weight: bold;">T</span> <span style="color: #bc6ec5; font-weight: bold;">execute</span><span style="color: #8d5649;">(</span><span style="color: #ce537a; font-weight: bold;">StatementCallback</span><span style="color: #d8241f;">&lt;</span><span style="color: #ce537a; font-weight: bold;">T</span><span style="color: #d8241f;">&gt;</span> <span style="color: #7590db;">action</span><span style="color: #8d5649;">)</span> <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">DataAccessException</span> <span style="color: #8d5649;">{</span>
  Assert.notNull<span style="color: #d8241f;">(</span>action, <span style="color: #2d9574;">"Callback object must not be null"</span><span style="color: #d8241f;">)</span>;

  <span style="color: #ce537a; font-weight: bold;">Connection</span> <span style="color: #7590db;">con</span> = DataSourceUtils.getConnection<span style="color: #d8241f;">(</span>obtainDataSource<span style="color: #9564bf;">()</span><span style="color: #d8241f;">)</span>;
  <span style="color: #ce537a; font-weight: bold;">Statement</span> <span style="color: #7590db;">stmt</span> = <span style="color: #a45bad;">null</span>;
  <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #d8241f;">{</span>
    <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#25191;&#34892; SQL, &#24182;&#36820;&#22238;&#32467;&#26524;</span>
    stmt = con.createStatement<span style="color: #9564bf;">()</span>;
    applyStatementSettings<span style="color: #9564bf;">(</span>stmt<span style="color: #9564bf;">)</span>;
    <span style="color: #ce537a; font-weight: bold;">T</span> <span style="color: #7590db;">result</span> = action.doInStatement<span style="color: #9564bf;">(</span>stmt<span style="color: #9564bf;">)</span>;
    handleWarnings<span style="color: #9564bf;">(</span>stmt<span style="color: #9564bf;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">return</span> result;
  <span style="color: #d8241f;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">catch</span> <span style="color: #d8241f;">(</span><span style="color: #ce537a; font-weight: bold;">SQLException</span> <span style="color: #7590db;">ex</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Release Connection early, to avoid potential connection pool deadlock</span>
    <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">in the case when the exception translator hasn't been initialized yet.</span>
    <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">sql</span> = getSql<span style="color: #9564bf;">(</span>action<span style="color: #9564bf;">)</span>;
    JdbcUtils.closeStatement<span style="color: #9564bf;">(</span>stmt<span style="color: #9564bf;">)</span>;
    stmt = <span style="color: #a45bad;">null</span>;
    DataSourceUtils.releaseConnection<span style="color: #9564bf;">(</span>con, getDataSource<span style="color: #24a222;">()</span><span style="color: #9564bf;">)</span>;
    con = <span style="color: #a45bad;">null</span>;
    <span style="color: #4f97d7; font-weight: bold;">throw</span> translateException<span style="color: #9564bf;">(</span><span style="color: #2d9574;">"StatementCallback"</span>, sql, ex<span style="color: #9564bf;">)</span>;
  <span style="color: #d8241f;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">finally</span> <span style="color: #d8241f;">{</span>
    JdbcUtils.closeStatement<span style="color: #9564bf;">(</span>stmt<span style="color: #9564bf;">)</span>;
    DataSourceUtils.releaseConnection<span style="color: #9564bf;">(</span>con, getDataSource<span style="color: #24a222;">()</span><span style="color: #9564bf;">)</span>;
  <span style="color: #d8241f;">}</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>
<ol class="org-ol">
<li><code>applyStatementSettings(...)</code> 用户设置输入参数
<ul class="org-ul">
<li>fectchSize 减少网络交互次数</li>
<li>maxRows 获取结果集的最大行数</li>
</ul></li>
<li><p>
<code>action.doInStatement(...)</code> 是调用 <code>StatementCallback</code> 类型的回调函数
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #a45bad;">@FunctionalInterface</span>
<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">interface</span> <span style="color: #ce537a; font-weight: bold;">StatementCallback</span><span style="color: #8d5649;">&lt;</span><span style="color: #ce537a; font-weight: bold;">T</span><span style="color: #8d5649;">&gt;</span> <span style="color: #8d5649;">{</span>
  <span style="color: #a45bad;">@Nullable</span>
  <span style="color: #ce537a; font-weight: bold;">T</span> <span style="color: #bc6ec5; font-weight: bold;">doInStatement</span><span style="color: #d8241f;">(</span><span style="color: #ce537a; font-weight: bold;">Statement</span> <span style="color: #7590db;">stmt</span><span style="color: #d8241f;">)</span> <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">SQLException</span>, <span style="color: #ce537a; font-weight: bold;">DataAccessException</span>;
<span style="color: #8d5649;">}</span>
</pre>
</div></li>
<li><code>handleWarnings(...)</code> 进行告警处理
<ul class="org-ul">
<li>这里的告警默认输出异常信息</li>
<li>可以通过配置抛出 <code>SQLWarningException</code> 异常</li>
</ul></li>
<li><code>DataSourceUtils.releaseConnection(...)</code> 释放连接</li>
</ol>
</div>
</div>

<div id="outline-container-orga64b5bc" class="outline-3">
<h3 id="orga64b5bc"><span class="section-number-3">3.4</span> 数据库更新: <code>update(...)</code> 方法</h3>
<div class="outline-text-3" id="text-3-4">
<p>
数据库更新和执行 SQL 类似，这里需要熟悉 <code>PreparedStatement</code> 接口，它是一预编
译的 SQL 语句
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #ce537a; font-weight: bold;">PreparedStatement</span> <span style="color: #7590db;">pstmt</span> = con.prepareStatement<span style="color: #8d5649;">(</span><span style="color: #2d9574;">"UPDATE EMPLOYEES SET SALARY = ? WHERE ID = ?"</span><span style="color: #8d5649;">)</span>;
pstmt.setBigDecimal<span style="color: #8d5649;">(</span>1, 153833.00<span style="color: #8d5649;">)</span>;
pstmt.setInt<span style="color: #8d5649;">(</span>2, 110592<span style="color: #8d5649;">)</span>;
</pre>
</div>

<p>
实际的 <code>update(...)</code> 方法实现如下
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">protected</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">update</span><span style="color: #8d5649;">(</span><span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">PreparedStatementCreator</span> <span style="color: #7590db;">psc</span>, <span style="color: #a45bad;">@Nullable</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">PreparedStatementSetter</span> <span style="color: #7590db;">pss</span><span style="color: #8d5649;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">DataAccessException</span> <span style="color: #8d5649;">{</span>

  logger.debug<span style="color: #d8241f;">(</span><span style="color: #2d9574;">"Executing prepared SQL update"</span><span style="color: #d8241f;">)</span>;

  <span style="color: #4f97d7; font-weight: bold;">return</span> updateCount<span style="color: #d8241f;">(</span>execute<span style="color: #9564bf;">(</span>psc, ps -&gt; <span style="color: #24a222;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #ff7f00;">{</span>
          <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #1776b6;">(</span>pss != <span style="color: #a45bad;">null</span><span style="color: #1776b6;">)</span> <span style="color: #1776b6;">{</span>
            <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#35774;&#32622; PreparedStatement &#30340;&#23454;&#38469;&#20540;</span>
            pss.setValues<span style="color: #00bed1;">(</span>ps<span style="color: #00bed1;">)</span>;
          <span style="color: #1776b6;">}</span>
          <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#35843;&#29992;&#26356;&#26032;&#35821;&#21477;</span>
          <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">rows</span> = ps.executeUpdate<span style="color: #1776b6;">()</span>;
          <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #1776b6;">(</span>logger.isTraceEnabled<span style="color: #00bed1;">()</span><span style="color: #1776b6;">)</span> <span style="color: #1776b6;">{</span>
            logger.trace<span style="color: #00bed1;">(</span><span style="color: #2d9574;">"SQL update affected "</span> + rows + <span style="color: #2d9574;">" rows"</span><span style="color: #00bed1;">)</span>;
          <span style="color: #1776b6;">}</span>
          <span style="color: #4f97d7; font-weight: bold;">return</span> rows;
        <span style="color: #ff7f00;">}</span>
        <span style="color: #4f97d7; font-weight: bold;">finally</span> <span style="color: #ff7f00;">{</span>
          <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #1776b6;">(</span>pss <span style="color: #4f97d7; font-weight: bold;">instanceof</span> ParameterDisposer<span style="color: #1776b6;">)</span> <span style="color: #1776b6;">{</span>
            <span style="color: #00bed1;">(</span><span style="color: #bcbf00;">(</span><span style="color: #ce537a; font-weight: bold;">ParameterDisposer</span><span style="color: #bcbf00;">)</span> pss<span style="color: #00bed1;">)</span>.cleanupParameters<span style="color: #00bed1;">()</span>;
          <span style="color: #1776b6;">}</span>
        <span style="color: #ff7f00;">}</span>
      <span style="color: #24a222;">}</span><span style="color: #9564bf;">)</span><span style="color: #d8241f;">)</span>;
<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2021-07-24 Sat 00:57. Created by Jinghui Hu at 2021-07-23 Fri 11:43.</p>
</div>
</body>
</html>
